"use strict";

const articleDetails = [
    {
        id: "ad_0",
        side: `<div class="articleDetails__blok">
        <h1 class="articleDetails__title">В РОСССИИ СОЗДАЛИ ПЕРВЫЕ СКОРОСТНЫЕ ЛИФТЫ</h1>
        <div class="articleDetails__box">
            <div class="articleDetails__imgbox">
                <img class="articleDetails__img" src="img/articles/speed_lifts.jpeg" alt="photo">
            </div>
            <h2 class="articleDetails__heading">В Копейске, Завод «Витчел» выпустил первые в России высокоскоростные лифты</h2>
            <p class="articleDetails__text">Это является значительным достижением для предприятия. И позволяет компании занять место на российском рынке, после того как иностранные производители, такие как американская Otis и финская Konе, покинули страну. Одна из моделей лифта, разработанная южноуральцами, способна достигать скорости до 4 метров в секунду, и уже выпущено 20 единиц этой модели. В настоящее время, другая модель лифта с скоростью до 6 метров в секунду проходит процесс сертификации.</p>
            <p class="articleDetails__text">Спрос на скоростные лифты высокой производительности велик в крупных российских городах с высотными зданиями, таких как Москва, Санкт-Петербург, Екатеринбург и Новосибирск. Однако, основные отечественные производители ограничивают скорость своих лифтов до 2,5 метров в секунду. Поэтому продукция «Витчел» уже вызывает повышенный интерес среди специалистов.</p>
            <p class="articleDetails__text">Напомним, что ранее в Челябинске также было достигнуто значительное достижение в области строительства - запущено производство стекол большой площади для высотных зданий как в России, так и за рубежом. Это говорит о том, что благодаря Южному Уралу строительство небоскребов может осуществляться без необходимости в импорте.</p>
        </div>
    </div>`,
    },
    {
        id: "ad_1",
        side: `<div class="articleDetails__blok">
        <h1 class="articleDetails__title">ВАКУУМНЫЙ ЛИФТ - БУДУЩЕЕ ВЕРТИКАЛЬНОГО ТРАНСПОРТА УЖЕ ЗДЕСЬ.</h1>
        <div class="articleDetails__box">
            <div class="articleDetails__imgbox">
                <img class="articleDetails__img" src="img/articles/vaccum_elevator.jpg" alt="photo">
            </div>
            <h2 class="articleDetails__heading">Вакуумный лифт – это новый вид транспорта, который использует вакуум для перемещения грузов и пассажиров.</h2>
            <p class="articleDetails__text">Этот тип лифта был разработан в 2014 году компанией LiftPort Group, Inc., и с тех пор он привлекает все большее внимание как в научных кругах, так и в индустрии.
            История создания вакуумного лифта началась еще в 19 веке. В 1867 году американский изобретатель Элисон Смит придумал идею создания вакуумного лифта, который бы мог перемещаться по вертикальной трубе, используя разность давления. Но в то время технологии не позволяли реализовать эту идею.</p>
            <p class="articleDetails__text">В 2014 году компания LiftPort Group, Inc. представила первый прототип вакуумного лифта. Он был установлен на высоте 50 метров и использовался для перемещения грузов. Вакуум создавался с помощью насоса, который выкачивал воздух из трубы, создавая разность давления. Первый прототип был успешно испытан, и компания начала работать над улучшением технологии.</p>
            <p class="articleDetails__text">Одной из особенностей вакуумного лифта является его скорость перемещения. Вакуумный лифт может достигать скорости до 1000 км/час, что в 10 раз быстрее, чем обычный лифт. Это позволяет существенно сократить время перемещения грузов и пассажиров между этажами здания.
            Еще одной особенностью вакуумного лифта является его экологичность. Вакуум создается с помощью насоса, который использует электричество. Но в то же время вакуум не требует энергии для поддержания разности давления, что позволяет существенно сократить затраты на энергию.</p>
            <p class="articleDetails__text">Вакуумный лифт может использоваться как для перемещения грузов, так и для перевозки пассажиров. Это позволяет существенно улучшить транспортную инфраструктуру городов и сократить время перемещения между зданиями. Одним из главных преимуществ вакуумного лифта является его безопасность. Вакуум создает надежную опору для лифта, что позволяет избежать аварийных ситуаций. Кроме того, вакуумный лифт не зависит от механических деталей, что снижает риск поломок и повышает надежность.</p>
            <p class="articleDetails__text">Несмотря на все преимущества вакуумного лифта, его создание и внедрение в массовое производство требует больших затрат. Необходимо разработать специальные трубы, насосы и другие компоненты, которые могут выдерживать высокие скорости и давления. Кроме того, необходимо провести масштабные испытания, чтобы убедиться в безопасности и эффективности технологии. Вакуумный лифт – это новый вид транспорта, который может революционизировать транспортную инфраструктуру городов. Он объединяет в себе скорость, экологичность и безопасность, что делает его привлекательным для использования в различных сферах. Несмотря на все преимущества, его создание и внедрение требует больших затрат и времени, но будущее этой технологии выглядит очень перспективным.
            </p>
        </div>
    </div>`,
    },
    {
        id: "ad_2",
        side: `<div class="articleDetails__blok">
        <h1 class="articleDetails__title">World Elevator & Escalator Expo</h1>
        <div class="articleDetails__box">
            <div class="articleDetails__imgbox">
                <img class="articleDetails__img" src="img/articles/wee.jpg" alt="photo">
            </div>
            <h2 class="articleDetails__heading">WEE Expo - это крупнейшая международная выставка лифтов и эскалаторов</h2>
            <p class="articleDetails__text">WEE Expo, которая проводится каждые два года в Шанхае, Китай. В 2023 году выставка пройдет уже в девятый раз и станет ещё более масштабной. Один из самых заметных углов выставки - это корнер, посвященный инновационным и передовым технологиям в лифтостроении. Здесь представлены самые современные разработки и решения, которые делают лифты более безопасными, удобными и энергоэффективными. На этом корнере посетители могут ознакомиться с новейшими технологиями в области электроники, связи, компьютеризации и интеграции, которые применяются в лифтах. Это включает в себя умные лифты с системами управления, которые могут прогнозировать спрос, минимизировать время ожидания, а также повышать безопасность и энергоэффективность. На этой выставке также представлены новейшие разработки в области эскалаторов и подъемников для инвалидов. Здесь можно увидеть инновационные решения, созданные с учетом безопасности, комфорта и доступности для всех. Корнер, посвященный инновациям в лифтостроении, позволяет производителям и поставщикам демонстрировать свои новые продукты и технологии, а также общаться с профессионалами и потенциальными клиентами. Это прекрасная возможность для обмена опытом, налаживания контактов и создания новых партнерств. World Elevator & Escalator Expo 2023 в Шанхае привлечет специалистов из разных стран мира и будет являться платформой для продвижения инноваций и развития лифтостроительной отрасли. Будет интересно увидеть, какие новые технологии и продукты будут представлены на этой выставке.</p>
            <p class="articleDetails__text">Спрос на скоростные лифты высокой производительности велик в крупных российских городах с высотными зданиями, таких как Москва, Санкт-Петербург, Екатеринбург и Новосибирск. Однако, основные отечественные производители ограничивают скорость своих лифтов до 2,5 метров в секунду. Поэтому продукция «Витчел» уже вызывает повышенный интерес среди специалистов.</p>
            <p class="articleDetails__text">Напомним, что ранее в Челябинске также было достигнуто значительное достижение в области строительства - запущено производство стекол большой площади для высотных зданий как в России, так и за рубежом. Это говорит о том, что благодаря Южному Уралу строительство небоскребов может осуществляться без необходимости в импорте.</p>
        </div>
    </div>`,
    },
    {
        id: "ad_3",
        side: `<div class="articleDetails__blok">
        <h1 class="articleDetails__title">Что делать если застряли в лифте?</h1>
        <div class="articleDetails__box">
            <div class="articleDetails__imgbox">
                <img class="articleDetails__img" src="img/articles/zastr.jpg" alt="photo">
            </div>
            <h2 class="articleDetails__heading">ЗАСТРЯТЬ В ЛИФТЕ НЕ САМАЯ ПРИЯТНАЯ СИТУАЦИЯ</h2>
            <p class="articleDetails__text">Но она может произойти с каждым из нас. Независимо от того, как долго вы уже находитесь внутри, главное - сохранять спокойствие и принимать необходимые меры для своей безопасности и быстрого освобождения из ловушки.
            Первое, что нужно сделать, если вы застряли в лифте - это нажать на кнопку вызова помощи. Обычно она находится рядом с панелью управления лифтом. Нажав на нее, вы свяжетесь с оператором диспетчерской службы, который организует вашу спасательную операцию.
            Если по каким-то причинам кнопка вызова помощи не работает, то попробуйте использовать мобильный телефон или интерком (если он есть внутри кабины).
            Сообщите диспетчеру свое местоположение и причину возникшей проблемы.</p>
            <p class="articleDetails__text">Важно помнить, что если внутри кабины нет связи с внешним миром, то не стоит паниковать и пытаться выбираться самостоятельно. Все действия должны быть осуществлены с учетом правил безопасности и только после получения инструкций от диспетчера.
            Если внутри кабины есть другие пассажиры, то необходимо спокойно объяснить им ситуацию и договориться о дальнейших действиях. Не стоит паниковать и создавать панику у других людей. Если вы застряли в лифте на длительный период времени, то нужно следить за своим состоянием здоровья.
            Важно не перегреваться, не терять сознание и не паниковать.</p>
            <p class="articleDetails__text">Если у вас есть медицинские противопоказания к длительному нахождению в закрытом пространстве, то сообщите об этом диспетчеру.
            Также можно занять себя чтением книги, игрой в мобильные игры или просто беседой с другими пассажирами.
            В заключение, хочется отметить, что застрять в лифте - это неприятная, но редкая ситуация. В большинстве случаев спасение приходит быстро и без последствий для здоровья.
            Главное - сохранять спокойствие, следовать инструкциям диспетчера и не паниковать.</p>
        </div>
    </div>`,
    },
    {
        id: "ad_4",
        side: `<div class="articleDetails__blok">
        <h1 class="articleDetails__title">Важность своевременной модернизации лифта</h1>
        <div class="articleDetails__box">
            <div class="articleDetails__imgbox">
                <img class="articleDetails__img" src="img/articles/moderniz.jpg" alt="photo">
            </div>
            <h2 class="articleDetails__heading">Строгий режим эксплуатации, ежедневная загрузка и непредвиденные неполадки</h2>
            <p class="articleDetails__text">- все это оказывает существенное воздействие на лифтовое оборудование. И вот через 15-20 лет возникает вопрос: стоит ли заменить его или провести модернизацию?</p>
            <p class="articleDetails__text">Причина, по которой многие предпочитают модернизацию, заключается в том, что некоторые компоненты, которые не были подвержены постоянным нагрузкам, могут прослужить еще несколько десятилетий. Вместе с тем, такой подход позволяет значительно сэкономить средства. Необходимо учитывать, что замена всего лифта требует значительных финансовых и временных затрат, в то время как модернизация позволяет сделать обновление только тех компонентов, которые действительно нуждаются в этом.
            Кроме того, модернизация лифта может принести дополнительные преимущества. Например, можно установить системы управления с ограничением доступа, улучшить системы безопасности, добавить возможность мониторинга и диагностики, а также улучшить энергоэффективность оборудования. В результате, модернизированный лифт будет соответствовать современным требованиям безопасности и комфорта, а также позволит сэкономить на расходах по эксплуатации.</p>
            <p class="articleDetails__text">Мы полностью понимаем значимость этих факторов и готовы предоставить комплексные и профессиональные услуги по модернизации лифтового оборудования. Наша команда экспертов поможет вам принять взвешенное решение и провести модернизацию, учитывая ваши потребности и бюджет.</p>
        </div>
    </div>`,
    },
    {
        id: "ad_5",
        side: `<div class="articleDetails__blok">
        <h1 class="articleDetails__title">Презентабельный лифт: источник гордости и символ стиля хозяина</h1>
        <div class="articleDetails__box">
            <div class="articleDetails__imgbox">
                <img class="articleDetails__img" src="img/articles/vaccum_elevator2.jpg" alt="photo">
            </div>
            <h2 class="articleDetails__heading">В современном мире, когда речь заходит о лифтах, отделка и дизайн интерьера играют не менее важную роль</h2>
            <p class="articleDetails__text">В современном мире, когда речь заходит о лифтах, отделка и дизайн интерьера играют не менее важную роль, чем технические характеристики. Они уже давно перешли в разряд самых востребованных требований к лифтовому оборудованию. Стандартные и обычные проекты пассажирских лифтов медленно уступают место потрясающим дизайнерским кабинкам, которые полностью отражают желания зажиточных клиентов. Возможность индивидуального заказа и украшения поверхности лифта стразами, росписью или логотипом стала популярной среди владельцев загородных домов, готовых платить за роскошь. Когда каждое перемещение по дому становится занимательным путешествием, особенно если к вашим услугам коттеджный лифт, сочетающийся с дизайном вашего дома.</p>
            <p class="articleDetails__text">Когда дело касается оснащения лифта, необходимо обратить внимание на использование передовых технологий, использование натуральных материалов и следование модным тенденциям. Все эти аспекты могут быть реализованы компетентными организациями через заключение соответствующего договора. В большинстве случаев, при продаже лифтов и их рекламе делается акцент на эстетических предложениях, подчеркивающих изысканность и элегантность кабин лифтов. Выбор материалов и оформление, совмещенные с вашим вкусом, позволят создать уникальный лифт, отвечающий вашим индивидуальным предпочтениям. При соблюдении нормативных требований безопасности, нет ограничений в декорировании лифтового оборудования. Сочетание технического аспекта с прекрасным дизайном – это лифт вашей мечты, и его воплощение зависит от вашей фантазии и финансовых возможностей.</p>
        </div>
    </div>`,
    },
    {
        id: "ad_6",
        side: `<div class="articleDetails__blok">
        <h1 class="articleDetails__title">Выбирайте идеальный лифт для вашего здания:</h1>
        <div class="articleDetails__box">
            <div class="articleDetails__imgbox">
                <img class="articleDetails__img" src="img/articles/ideal.jpeg" alt="photo">
            </div>
            <h2 class="articleDetails__heading">7 ФАКТОРОВ, КОТОРЫЕ НЕОБХОДИМО УЧИТЫВАТЬ!</h2>
            <p class="articleDetails__text">Лифты являются неотъемлемой частью современных зданий. Они обеспечивают удобство и безопасность для людей, которые перемещаются по зданию, а также способствуют экономии времени. Выбор подходящего лифта для здания является важным шагом, который необходимо сделать в процессе строительства или реконструкции здания. В данной статье мы рассмотрим основные факторы, которые следует учитывать при выборе подходящего лифта для здания.</p>
            <p class="articleDetails__text">1. Вместимость</p>
            <p class="articleDetails__text">Один из первых факторов, который следует учитывать при выборе лифта, это его вместимость. Необходимо определить, сколько человек должен вмещать лифт, чтобы обеспечить комфортное перемещение людей по зданию. Если здание имеет большой поток людей, то необходимо выбирать лифты с большой вместимостью.</p>
            <p class="articleDetails__text">2. Скорость</p>
            <p class="articleDetails__text">Скорость лифта является еще одним фактором, который следует учитывать при выборе подходящего лифта для здания. Скорость лифта должна соответствовать потребностям здания. Если здание имеет большой поток людей, то необходимо выбирать лифты с высокой скоростью, чтобы обеспечить быстрое перемещение людей по зданию.</p>
            <p class="articleDetails__text">3. Размеры кабины</p>
            <p class="articleDetails__text">Размеры кабины лифта являются еще одним фактором, который следует учитывать при выборе подходящего лифта для здания. Размеры кабины должны соответствовать потребностям здания. Если здание имеет большой поток людей, то необходимо выбирать лифты с большими кабинами, чтобы обеспечить комфортное перемещение людей по зданию.</p>
            <p class="articleDetails__text">4. Технические характеристики</p>
            <p class="articleDetails__text">Технические характеристики лифта являются еще одним фактором, который следует учитывать при выборе подходящего лифта для здания. Технические характеристики должны соответствовать потребностям здания. Необходимо учитывать такие параметры, как максимальный вес, мощность двигателя, тип управления и т.д.</p>
            <p class="articleDetails__text">5. Энергоэффективность</p>
            <p class="articleDetails__text">Энергоэффективность является важным фактором при выборе подходящего лифта для здания. Энергоэффективный лифт может значительно снизить затраты на электроэнергию и уменьшить нагрузку на систему кондиционирования воздуха. При выборе лифта необходимо учитывать его энергоэффективность.</p>
            <p class="articleDetails__text">6. Безопасность</p>
            <p class="articleDetails__text">Безопасность является важным фактором при выборе подходящего лифта для здания. Необходимо выбирать лифты, которые соответствуют требованиям безопасности. Лифты должны быть оборудованы системами безопасности, такими как аварийное торможение, система пожарной сигнализации и т.д.</p>
            <p class="articleDetails__text">7. Стоимость</p>
            <p class="articleDetails__text">Стоимость является еще одним фактором, который следует учитывать при выборе подходящего лифта для здания. Необходимо выбирать лифты, которые соответствуют бюджету здания. При выборе лифта необходимо учитывать не только стоимость его установки, но и стоимость его эксплуатации..</p>
            <p class="articleDetails__text">В заключение, выбор подходящего лифта для здания является важным шагом, который необходимо сделать в процессе строительства или реконструкции здания. При выборе лифта необходимо учитывать такие факторы, как вместимость, скорость, размеры кабины, технические характеристики, энергоэффективность, безопасность и стоимость. Правильный выбор лифта обеспечит комфортное и безопасное перемещение людей по зданию.</p>
        </div>
    </div>`,
    },
    {
        id: "ad_7",
        side: `<div class="articleDetails__blok">
        <h1 class="articleDetails__title">Установка лифта в старом здании</h1>
        <div class="articleDetails__box">
            <div class="articleDetails__imgbox">
                <img class="articleDetails__img" src="img/articles/oldhome.jpeg" alt="photo">
            </div>
            <h2 class="articleDetails__heading">КАК ИЗБЕЖАТЬ ПРОБЛЕМ И ОБЕСПЕЧИТЬ БЕЗОПАСНОСТЬ</h2>
            <p class="articleDetails__text">Установка лифта в старом здании – это сложный и многопроцессный процесс, который требует тщательного планирования и оценки всех возможных рисков. Несмотря на все усилия, которые предпринимаются для установки лифта в старом здании, возникают различные проблемы, к оторые могут затруднить или даже прервать процесс установки.</p>
            <p class="articleDetails__text">Проблема №1: Несоответствие стандартам безопасности</p>
            <p class="articleDetails__text">Одной из главных проблем, с которой сталкиваются при установке лифта в старом здании, является несоответствие здания современным стандартам безопасности. В зависимости от возраста здания, его конструкции и размеров, может потребоваться значительная модернизация, чтобы соответствовать требованиям безопасности.</p>
            <p class="articleDetails__text">Проблема №2: Ограниченное пространство</p>
            <p class="articleDetails__text">ругой проблемой, связанной с установкой лифта в старом здании, является ограниченное пространство. В старых зданиях часто отсутствуют свободные площади для установки лифта. Кроме того, некоторые здания имеют сложную архитектуру, что может затруднить установку лифта в определенном месте.</p>
            <p class="articleDetails__text">Проблема №3: Сложность проектирования</p>
            <p class="articleDetails__text">становка лифта в старом здании требует тщательного проектирования. Это может быть сложным процессом, особенно если здание имеет нестандартную конструкцию или если требуется установить лифт в уже существующее здание. Проектирование может потребовать значительных временных и финансовых затрат.</p>
            <p class="articleDetails__text">Проблема №4: Необходимость модернизации инфраструктуры</p>
            <p class="articleDetails__text">Установка лифта в старом здании может потребовать модернизации инфраструктуры, такой как электрические системы, вентиляция и системы безопасности. Это может быть дополнительным финансовым бременем для владельца здания.</p>
            <p class="articleDetails__text">Проблема №5: Сложность монтажа</p>
            <p class="articleDetails__text">Установка лифта в старом здании может быть сложной задачей из-за различных препятствий, таких как стены, потолки и другие конструкции. Монтаж может потребовать использования специального оборудования и технических решений.</p>
            <p class="articleDetails__text">Проблема №6: Высокая стоимость</p>
            <p class="articleDetails__text">Установка лифта в старом здании может быть очень дорогостоящей процедурой. Это связано с необходимостью модернизации инфраструктуры, проектирования, монтажа и других факторов. Владельцы зданий должны быть готовы к высоким расходам на установку лифта.</p>
            <p class="articleDetails__text">В заключение, установка лифта в старом здании – это сложный процесс, который требует тщательного планирования и оценки всех возможных рисков. Несмотря на все усилия, которые предпринимаются для установки лифта в старом здании, возникают различные проблемы, которые могут затруднить или даже прервать процесс установки. Владельцы зданий должны быть готовы к высоким расходам и тщательно планировать процесс установки, чтобы избежать возможных проблем.</p>
        </div>
    </div>`,
    },
    {
        id: "ad_8",
        side: `<div class="articleDetails__blok">
        <h1 class="articleDetails__title">Тишина и комфорт.</h1>
        <div class="articleDetails__box">
            <div class="articleDetails__imgbox">
                <img class="articleDetails__img" src="img/articles/silence.jpg" alt="photo">
            </div>
            <h2 class="articleDetails__heading">КАК СОВРЕМЕННЫЕ ТЕХНОЛОГИИ ПОМОГАЮТ СНИЗИТЬ ШУМ В ЛИФТАХ</h2>
            <p class="articleDetails__text">Шум в лифте - это распространенная проблема, с которой сталкиваются многие люди. Особенно это актуально в многоэтажных зданиях, где работа лифта может вызывать дискомфорт для обитателей. Однако, благодаря развитию технологий, сегодня существуют различные методы и инновационные решения, которые позволяют снизить шум в лифте. Давайте рассмотрим некоторые из них.</p>
            <p class="articleDetails__text">Изоляция лифтового шахтового пространства:</p>
            <p class="articleDetails__text">Одним из наиболее эффективных способов снижения шума в лифте является установка специальной шумоизоляционной системы в лифтовом шахте. Такие системы рассчитаны на поглощение звуковых волн и позволяют значительно снизить уровень шума, передаваемого в помещения. Это достигается за счет использования специальных материалов и технологий, обеспечивающих звукопоглощение и звукоизоляцию.</p>
            <p class="articleDetails__text">Подвижные резиновые опоры:</p>
            <p class="articleDetails__text">Чтобы снизить шум от вибрации и тряски, вызванной работой лифта, могут использоваться подвижные резиновые опоры. Они позволяют снизить передачу вибраций на стены и полы здания, что сокращает уровень шума внутри помещений. Использование таких опор является одним из самых эффективных способов борьбы с шумом в лифте.</p>
            <p class="articleDetails__text">Шумопоглощающие материалы:</p>
            <p class="articleDetails__text">Внутри лифта можно использовать специальные шумопоглощающие материалы, которые помогут снизить уровень шума. Они могут быть установлены на стены, потолок и даже на пол лифта. Такие материалы обладают высокой способностью поглощать звук и снижать его отражение, что приводит к уменьшению шума внутри лифта.</p>
            <p class="articleDetails__text">Технологии противовесов и моторов:</p>
            <p class="articleDetails__text">В современных лифтах применяются специальные технологии, которые позволяют снизить уровень шума, связанного с движением кабины. Например, использование противовесов с шумопоглощающими материалами или применение бесщеточных двигателей, которые работают практически бесшумно, снижает производимый шум во время движения лифта.</p>
            <p class="articleDetails__text">Интеллектуальные системы</p>
            <p class="articleDetails__text">Современные лифты оснащены интеллектуальными системами управления, которые позволяют оптимизировать и контролировать работу лифта с целью снижения шума. Например, автоматическое управление скоростью и ускорением лифта может снизить уровень шума при его запуске и остановке.</p>
            <p class="articleDetails__text">Примеры из практики:</p>
            <p class="articleDetails__text">- Компания OTIS разработала систему Gen2, в которой использованы шумопоглощающие материалы и новейшие технологии противовесов. Система обеспечивает практически бесшумное перемещение кабины лифта.</p>
            <p class="articleDetails__text">- Компания KONE представила систему MonoSpace 500, которая оснащена инновационными вибропоглощающими компонентами и шумопоглощающими материалами. Это позволяет значительно снизить уровень шума внутри лифта.</p>
            <p class="articleDetails__text">В заключение, технологии для снижения шума в лифте постоянно развиваются, и сегодня уже существуют различные инновационные решения для достижения этой цели. Помимо уже упомянутых методов, существует множество других технологий, включая акустические панели, звуковые изоляционные системы и шумопоглощающие конструкции. Регулярное обслуживание и техническое обновление лифтов также являются важными факторами для поддержания минимального уровня шума. В конечном итоге, правильный выбор технологий и оснащения лифта поможет создать комфортные условия для пассажиров и улучшить общую атмосферу в многоэтажном здании.</p>
        </div>
    </div>`,
    },
    {
        id: "ad_9",
        side: `<div class="articleDetails__blok">
        <h1 class="articleDetails__title">КАК ИНТЕЛЛЕКТУАЛЬНЫЕ ЛИФТЫ ИЗМЕНЯЮТ БУДУЩЕЕ ВЕРТИКАЛЬНОЙ МОБИЛЬНОСТИ: УМНЫЕ ТЕХНОЛОГИИ ДЛЯ КОМФОРТНОГО И ЭНЕРГОЭФФЕКТИВНОГО ПЕРЕМЕЩЕНИЯ</h1>
        <div class="articleDetails__box">
            <div class="articleDetails__imgbox">
                <img class="articleDetails__img" src="img/articles/scale.jpg" alt="photo">
            </div>
            <h2 class="articleDetails__heading">Интеллектуальные лифты: особенности работы и эксплуатации</h2>
            <p class="articleDetails__text">Интеллектуальные лифты - это новое поколение лифтов, обладающих передовыми технологиями и инновационными возможностями. Они являются более умными и эффективными в сравнении с традиционными лифтами. В этой статье мы рассмотрим преимущества интеллектуальных лифтов, их особенности работы и эксплуатации.</p>
            <p class="articleDetails__text">Одним из ключевых преимуществ интеллектуальных лифтов является их энергоэффективность. Они оснащены передовыми системами регулирования энергопотребления, что позволяет снизить расходы на электроэнергию и сохранить ресурсы. Интеллектуальные лифты используют технологию "зеленого лифта", которая включает в себя такие функции, как рекуперация энергии при спуске, автоматическое выключение подсветки и системы кондиционирования в случае неиспользования лифта, а также системы энергосбережения во время пикового потребления.</p>
            <p class="articleDetails__text">Кроме того, интеллектуальные лифты обладают расширенным функционалом и множеством дополнительных возможностей. Они могут быть интегрированы с системами управления зданиями, что позволяет автоматически подстраивать работу лифта в зависимости от загруженности и потребностей, оптимизировать перемещение грузов и людей, а также предоставлять информацию о состоянии и местоположении лифта в реальном времени. Интеллектуальные лифты также оборудованы сенсорами безопасности, системами диагностики и мониторинга, что повышает уровень безопасности и минимизирует время простоя в случае неполадок.</p>
            <p class="articleDetails__text">Одной из интересных особенностей интеллектуальных лифтов является возможность маршрутизации вызовов. Система приоритетов позволяет лифтам эффективно оптимизировать маршруты, что сокращает время ожидания и повышает пропускную способность. Например, если в одном здании есть несколько лифтов, они могут распределить вызовы таким образом, чтобы каждый из них работал наиболее эффективно.</p>
            <p class="articleDetails__text">Когда дело доходит до эксплуатации, интеллектуальные лифты также имеют свои преимущества. Благодаря системам диагностики и мониторинга, операторы могут получать информацию о состоянии лифта в режиме реального времени, ч то позволяет оперативно реагировать на возможные неисправности и проводить профилактическое обслуживание. Это помогает сократить время простоя и замены подвижных частей, а также улучшить общую производительность и надежность работы лифта.</p>
            <p class="articleDetails__text">Однако, следует отметить, что интеллектуальные лифты имеют и свои недостатки. Первым и наиболее заметным из них является их более высокая стоимость по сравнению с обычными лифтами. Это связано с более сложной конструкцией и установкой передовых систем и технологий. Кроме того, в случае аварий или неполадок, требуется специализированное обслуживание и ремонт, что может быть более дорогостоящим.</p>
            <p class="articleDetails__text">В заключение, интеллектуальные лифты предлагают множество преимуществ в сравнении с традиционными лифтами. Они энергоэффективны, обладают расширенным функционалом и оптимизированной производительностью. Однако, следует учитывать их более высокую стоимость и обслуживание. Все это делает интеллектуальные лифты привлекательным и высокотехнологичным вариантом для современного мира, где эффективность и безопасность имеют большое значение.</p>
        </div>
    </div>`,
    },
    {
        id: "ad_10",
        side: `<div class="articleDetails__blok">
        <h1 class="articleDetails__title">ОТ ПОДЪЕМНИКА ДО СОВРЕМЕННОГО ЛИФТА: ЭВОЛЮЦИЯ ВЕРТИКАЛЬНОЙ ТРАНСПОРТИРОВКИ. ЧАСТЬ 1</h1>
        <div class="articleDetails__box">
            <div class="articleDetails__imgbox">
                <img class="articleDetails__img" src="img/articles/scale1Eval.jpg" alt="photo">
            </div>
            <h2 class="articleDetails__heading">Если лифта бы не было, то людям пришлось бы его придумать!</h2>
            <p class="articleDetails__text">История изобретения лифта действительно окутана тайной и загадкой. На самом деле, до сих пор нет однозначного ответа на вопрос, какими механизмами строились огромные египетские пирамиды. Возможно, в то время использовались подъемники, способные перемещать огромные каменные плиты.</p>
            <p class="articleDetails__text">По официальной версии, лифт, подъемный кран, лебедка и другие подъемные механизмы имеют одного общего предка - рычаг, который был знаком человечеству с древних времен. Уже в древнем Египте был известен рычаг в форме колодезного журавля. В письменных источниках Древнего Египта, которые датируются примерно 2600 годом до нашей эры, есть упоминания о подъемной платформе, которая использовалась для перемещения грузов весом около 90 кг. Подъемник приводился в движение при помощи людей или животных</p>
            <p class="articleDetails__text">В Древнем Риме в городе Геркуланум был найден самый древний прототип лифта. Город Геркуланум находился у подножия вулкана Везувий и подобно Помпеям стал его жертвой. При археологических раскопках в этом доме были найдены очень хорошо сохранившиеся части древнего подъемника. Археологическая находка датируется 79 годом нашей эры – годом извержения вулкана Везувия. Сам подъемник использовался для поднятия блюд из кухни в столовую и приводился в движение при помощи людской мускульной силы.</p>
            <p class="articleDetails__text">Есть реальное письменное упоминание о существовании конструкции являющейся предком лифта, которые относятся к более раннему периоду. Впервые конструкцию лифта описывает римский архитектор Витрувий в своем трактате «Десять книг об архитектуре» обращая внимание на то, что конструкцию подъемника разработал Архимед из Сиракуз по его заказу. Историки датируют эту рукопись 236 годом до нашей эры.</p>
            <p class="articleDetails__text">Также доподлинно известно что во дворце римского императора Нерона тоже был лифт. Там его использовали не только для перевозки грузов, но и для перевозки людей. Нерон был настоящим театралом и часто устраивал театральные представления у себя во дворце. Подъемник помогал актерам и декорациям попадать на сцену. Как и подъемник из Геркуланума приводился в действие мускульной силой.</p>
            <p class="articleDetails__text">Но самым массовым использованием прародителя лифтов в Древнем Риме было в Колизее. Там было целых 12 подъемников, которые поднимали гладиаторов и животных на поверхность арены.
            Это было необходимо для проведения гладиаторских боев. И вот, как мы видим на фотографии лифтов в Колизее, они использовали систему блоков и приводились в движение рабами. По материалам, оставленным Филоном Александрийским, мы знаем, что в эпоху его жизни в Александрии(Египет), был разработан и использовался механизм, который напоминал лифт и предназначался для подъема воды из реки. Этот механизм работал по принципу, схожем с принципом действия лифта.</p>
            <p class="articleDetails__text">Есть свидетельства о наличии лифта в Синайском монастыре (Египет, VI век нашей эры). По некоторым источникам, он состоял из плетеной клети, которая была подвешена на веревках из пеньки. Механизм приводился в действие благодаря колесу, которое двигалось от движения ослов. Также, в XVI-XVII веках нашей эры, крестьяне Индии использовали механизм, аналогичный принципу работы лифта, чтобы извлекать воду из рек.</p>
            <p class="articleDetails__text">Есть исторические документы, свидетельствующие о существовании подобных конструкций в Китае в XVII веке. Они использовались для подъема воды из реки. Одна из интересных особенностей этих механизмов заключалась в том, что они приводились в движение при помощи педалей, которые вращались двумя людьми. Благодаря этому, подъем воды осуществлялся с помощью ног, что позволяло более эффективно использовать человеческую мускулатуру.</p>
            <p class="articleDetails__text">В процессе добычи полезных ископаемых в Европе и на Востоке широко применялись подъемники для транспортировки людей и грузов. Они работали по принципу, когда движение подъемного механизма обеспечивали животные. Такой подход позволял эффективно осуществлять подъем и спуск на большие глубины в карьерах и шахтах.</p>
            <p class="articleDetails__text">Продолжение следует...</p>
        </div>
    </div>`,
    },
    {
        id: "ad_11",
        side: `<div class="articleDetails__blok">
        <h1 class="articleDetails__title">ОТ ПОДЪЕМНИКА ДО СОВРЕМЕННОГО ЛИФТА: ЭВОЛЮЦИЯ ВЕРТИКАЛЬНОЙ ТРАНСПОРТИРОВКИ. ЧАСТЬ 2</h1>
        <div class="articleDetails__box">
            <div class="articleDetails__imgbox">
                <img class="articleDetails__img" src="img/articles/scale2Eval.jpg" alt="photo">
            </div>
            <h2 class="articleDetails__heading">В 17-М ВЕКЕ ЛИФТЫ СТАЛИ ПРЕДМЕТОМ РОСКОШИ И РАЗВЛЕЧЕНИЯ СРЕДИ ЗНАТНЫХ ОСОБ.</h2>
            <p class="articleDetails__text">В одном из дворцов Петергофа, при Петре Первом, был построен небольшой грузовой лифт, который служил для перемещения обеденного стола между первым и вторым этажами. Интересно, что имя мастера, создавшего этот лифт, не сохранилось до наших дней.
            В 1743 году в королевском дворце Версаля во Франции Людовик XV заказал специальный пассажирский лифт. Он был создан для того, чтобы король мог посещать свою возлюбленную, чьи апартаменты находились на верхнем этаже, без особых трудностей.
            Король Людовик XV нуждался в помощи слуги, чтобы скрытно посещать свою возлюбленную. Именно этот слуга знал, когда и во сколько король отправлялся к своей даме и когда он возвращался. Если один слуга был в курсе, значит, вероятно, и весь двор об этом знал. Никакого уважения к личной жизни!</p>
            <p class="articleDetails__text">Необычный эпизод произошел в 1795 году в Зимнем дворце в Петербурге. Члены царского двора были поражены, наблюдая за толстым и преуспевающим Александром Безбородко, который необычно взволнованно и возбужденно перемещался по коридорам. Оказалось, что он только что воспользовался новым изобретением - "самоподъемным креслом", которое поднималось с первого этажа прямо в царские апартаменты. В сущности, это стало первоначальным прототипом лифта.</p>
            <p class="articleDetails__text">Величественное изобретение И. Кулибина - подъемный механизм - работал при помощи небольшой команды из одного или двух человек. Они перемещали специальные гайки вдоль вертикально установленных ходовых винтов, которые поднимали платформу с кабиной. Это первоначальное подъемное кресло было одним из самых популярных развлечений для высших должностных лиц и дворцовой службы. Фактически, это стало первым пассажирским лифтом, построенным в Российской империи.</p>
            <p class="articleDetails__text">В 1800 году произошло значимое событие - впервые в истории лифтов была использована паровая машина в качестве привода. Это произошло на одной из шахт в Америке, где добывался каменный уголь. Владелец шахты пришел к выводу, что применение паровой машины позволит увеличить скорость подъема угля и рабочих, тем самым повышая эффективность производства. Это стало началом новой эры коммерческой эксплуатации лифтов. Отныне использование лифтов стало экономически выгодным. Уже в 1835 году паровые грузовые лифты активно применялись на промышленных предприятиях в Англии.</p>
            <p class="articleDetails__text">Паровые лифты, как и любая новая технология, имели и свои недостатки. Одним из них была необходимость постоянно поддерживать работу паровой машины. Это было не так проблематично на шахтах, где лифты работали непрерывно, но на обычных предприятиях, где лифты использовались только время от времени, это становилось огромной проблемой. К тому же, паровые машины издавали такой шум, что их использование в жилых домах было просто невозможно.</p>
            <p class="articleDetails__text">В 1845 году Вильям Томсон из США создал первый гидравлический лифт. Конечно, у него тоже были свои недостатки - например, для работы нужен был источник давления в жидкости, такой как паровая машина. Но по сравнению с паровыми лифтами, главным преимуществом гидравлического лифта было то, что источник давления мог находиться в другом месте, далеко от самого лифта, и жидкость могла быть подана по трубопроводу высокого давления. В то время некоторые города уже имели централизованную водопроводную систему, но давление в ней было недостаточным для работы лифтов Томсона - всего 0,38 МПа.</p>
            <p class="articleDetails__text">В 1851 году Вильям Армстронг - создал гидравлический аккумулятор чтобы увеличить и обеспечить постоянное давление в цилиндре. Он использовал большой вертикальный цилиндр с плунжером, который поддерживал стальной ящик заполненный камнями или гравием. В итоге это позволяло поддерживать равномерное давление в воде, которая поступала в цилиндр. Подъемник Армстронга был оборудован ключевыми компонентами современного гидравлического лифта и многие разработки в Европе в целом сосредоточились на модернизации конструкций лифтов с гидроцилиндром.</p>
            <p class="articleDetails__text">Один из первых такой лифт был установлен в 1849 году в гостинице Osmaston Manor. К 1960 году крупные гостиницы в Англии начали использовать гидравлические пассажирские лифты. Это было временем совместного использования гидравлических и паровых лифтов.
            в 1852 году Элайша Грейвс Отис, американский инженер, придумал необычайное изобретение, которое превратило лифты в наиболее безопасный вид транспорта.</p>
            <p class="articleDetails__text">За свой жизненный путь Элайша Грейвс Отис пробовал себя в различных профессиональных сферах. Он начинал свою карьеру как строительный рабочий, позднее Отис работал на лесопилке, также приобрел опыт в производстве карет. Далее, Отис имел возможность принять участие в производстве мебели на мебельной фабрике, специализирующейся на производстве кроватей. Именно на мебельной фабрике Элайша Грейвс Отис получил задание в 1852 году разработать механизм подъемника для удобной доставки досок на второй этаж. Будучи полностью погруженным в работу над этим проектом, Отис совершил переломный шаг в своей карьере. Он создал идею, которая стала его ключевым изобретением.</p>
            <p class="articleDetails__text">Когда речь шла о креплении троса к кабине подъемника, Отис придумал что-то совершенно новое. Вместо того, чтобы просто привязать трос напрямую, он решил использовать упругую стальную пластину-рессору. Он также добавил зубчатые рельсы по бокам подъемника. Таким образом, даже при отсутствии груза, пружина была слегка изогнута и свободно скользила между рельсами. Однако, в случае обрыва троса, пружина мгновенно выпрямлялась - ее концы застревали в зубцах рельсов, предотвращая падение подъемника.
            Усовершенствовав свою конструкцию подъемника, Отис дал ему прозвище "безопасный лифт". Он основал компанию Otis Elevator, чтобы начать производство и продажу этих новых лифтов. В 1854 году, стремясь увеличить спрос на свою продукцию, Отис придумал гениальный рекламный трюк.</p>
            <p class="articleDetails__text">На одной из выставок в Нью-Йорке, в помещении с высоким куполом, был построен особый экспериментальный подъемник. Между двумя 12-метровыми столбами перемещалась подъемная платформа. На самом верху, сооружения, находился помощник, который держал в руках длинный меч. На платформе, среди бочек и ящиков, стоял сам изобретатель в своем элегантном фраке и цилиндре. Паровая машина аккуратно подтягивала платформу к самой вершине, а по команде Отиса ассистент неожиданно обрубал канат мечом. Платформа начинала свое стремительное падение, но через два метра механизм автоматически включался со страшным скрипом и останавливал падение платформы. Отис снимал свой цилиндр и с благодарностью кланялся перед восхищенной публикой.</p>
            <p class="articleDetails__text">Через три года, в 1857 году, компания Otis Elevator установила свой первый пассажирский лифт в пятиэтажном здании на Бродвее. Данный лифт мог вместить до пяти человек и доставлял их со скоростью 20 сантиметров в секунду.
            Во второй половине XIX века в США началась знаменательная эпоха развития строительства небоскребов. В первых построенных небоскребах широко использовались гидравлические лифты без использования канатов. Эти лифты работали на основе гидравлической системы, в которой поршень, расположенный в длинном цилиндре, под давлением воды вталкивал кабину вверх.</p>
            <p class="articleDetails__text">Данное гидравлическое решение было ограничено использованием в зданиях, не превышающих 20 этажей, ввиду потребности в глубокой яме для размещения гидроцилиндра под фундаментом здания. Однако следует отметить, что гидравлические лифты обладали значительно более высокой скоростью перемещения по сравнению с паровыми лифтами системы Отиса.
            На самом деле, с течением времени гидравлические системы были усовершенствованы. Теперь, вместо вертикального размещения цилиндра, его стали располагать горизонтально, а поршень, двигаясь по системе блоков, тянул за собой канат, который поднимал кабину лифта. Это позволило еще более эффективно использовать гидравлику в небоскребах и повысить их функциональность.</p>
            <p class="articleDetails__text">В 1859 году компания Otis Elevator разработала винтовой лифт для отеля "Пятая авеню". Оригинальная конструкция предусматривала наличие огромного металлического винта, который пронизывал здание от подвала до чердака, а кабина лифта двигалась вверх и вниз по этому винту, подобно гайке. Данное решение было технически инновационным и внесло значительный вклад в развитие лифтовой индустрии, открытой в то время.
            Винтовой лифт в отеле "Пятая авеню" работал следующим образом: винт вращался с помощью шкива, приводимого в движение ремнем от паровой машины, установленной в подвале здания. При вращении винта вправо, кабина лифта перемещалась вверх, а при вращении влево - вниз. Чтобы предотвратить вращение кабины вместе с винтом, вдоль одного из ее углов в шахте лифта установлен рельс-ограничитель. Однако, эта система оказалась медленной, неудобной и дорогостоящей. В результате, в отеле были установлены всего два таких лифта, которые проработали до 1875 года.</p>
            <p class="articleDetails__text">Также в то время активно модернизировались гидравлические лифты. На Всемирной выставке 1867 года в Париже инженер Леон Эдду представил свою конструкцию лифта, который использовался в Галерее механизмов для перевозки посетителей на высоту 2 метра до наблюдательной платформы.
            Для конструкции лифта использовался полый плунжер диаметром 24,5 см, который состоял из четырех отдельных частей. Кабина лифта была привязана к верхней части плунжера и перемещалась по четырем пустотелым чугунным колоннам, которые одновременно служили основой для шахты.
            Внутри колонн передвигались противовесы, которые были подвешены на цепях и огибали блоки верхней части шахты, а также были закреплены на раме кабины. Несмотря на это, множество критиков указывали на то, что такой лифт не подходит для зданий с большим количеством этажей.
            В ответ на критику Леоном Эдду был представлен лифт на Парижской выставке в 1878 году. Этот лифт был оснащен плунжерным цилиндром прямого действия и имел высоту подъема в 128,5 метров.
            Цилиндр был установлен под кабиной в специальном колодце, где его дно находилось на глубине 16 метров ниже уровня моря. Для работы системы лифта также использовалась вода из городской водопроводной сети.</p>
            <p class="articleDetails__text">Спустя небольшой промежуток времени этот тип лифта был установлен на Эйфелевой башне, что подтвердило надежность конструкции французского изобретателя. Благодаря этому, люди могли без труда наслаждаться потрясающими видами Парижа с обзорной площадки башни.
            Фирма Otis Elevator не желала отступать перед конкурентами, которые производили гидравлические лифты. Поэтому, начиная с 1874 года, они стали предлагать свои собственные гидравлические пассажирские лифты и грузовые подъемники.</p>
            <p class="articleDetails__text">Противостояние между гидравлическими и паровыми лифтами продолжалось бы длиться дольше, но в 1880 году немецкий инженер Вернер фон Сименс внес свой вклад в историю лифтостроения, построив первый в мире электрический лифт. Этот лифт впервые был установлен в городе Мангейм и мог подняться на высоту 22 метра всего за 11 секунд.</p>
            <p class="articleDetails__text">В 1889 году компания Otis Elevator установила свой первый электрический лифт в одном из небоскребов Нью-Йорка.
            В 1887 году американский изобретатель А. Майлс получил патент на свой электрический лифт, который включал в себя инновационную систему блокировки дверей лифтовой шахты, чтобы предотвратить их открытие в случае отсутствия лифтовой кабины на этаже.</p>
        </div>
    </div>`,
    },
];

let idAd = localStorage.getItem("LiftComplexArticl");
//localStorage.removeItem("LiftComplexArticl");

const articleD_El = document.querySelector("#artD");
articleD_El.innerHTML += articleDetails[idAd].side;
