"use strict";

const servicesDetails = [
    {
        id: "sd_0",
        top: `<div class="top__content">
        <h1 class="top__title">Проектирование лифтов</h1>
        <p class="top__text">Всего за 2 дня мы подготовим для Вас проектную документацию высочайшего качества. Ведь специалисты «Лифт Комплекс» всегда проводят натурные замеры, чтобы создать самый лучший проект для Вас.</p>
        <p class="top__text" id="toptextS">Наши инженеры-проектировщики имеют не менее 6 лет опыта работы, что говорит о их профессионализме и надежности. Заказывая проектную документацию у нас, Вы также экономите 15% бюджета при строительстве объекта. Это потому, что мы предлагаем наши услуги по самым выгодным ценам на рынке.</p>
        <p class="top__text" id="toptextS1">Так что не медлите, доверьтесь нам, и мы с удовольствием поможем Вам воплотить в жизнь Ваш проект! 
        </p>
    </div>
    <img src="img/services/project1440.jpg" alt="photo">`,
        side: `<div class="side__top" id="sideS">
        <h1 class="side__title">ТИПЫ ЛИФТОВЫХ ПРОЕКТОВ</h1>
        <ul class="side__ul">
            <li class="side__li"><strong>У нас есть обширный опыт в выполнении различных видов проектов лифтов, и мы готовы быстро и качественно выполнить для вас:</strong></li>
            <li class="side__li"><strong>- Проект замены лифтов: Если вам необходимо обновить существующие лифты, мы разработаем и предоставим вам проект замены, который будет соответствовать вашим потребностям и требованиям.</strong></li>
            <li class="side__li"><strong>- Проект приставных шахт лифтов: Если вам нужны лифты, которые будут добавлены к уже существующим зданиям, мы разработаем проект приставных шахт лифтов - будь то глухие или остекленные шахты - чтобы гармонично вписать их в уже существующую архитектуру.</strong></li>
            <li class="side__li"><strong>- Проект реконструкции строительной части для установки лифтов: Если вам необходимо изменить структуру здания, чтобы установить новые лифты, мы предоставим вам проект реконструкции строительной части, который будет учитывать ваши потребности и сделает процесс установки лифтов более эффективным.</strong></li>
            <li class="side__li"><strong>- Проект вновь возводимой строительной части лифтов: Если вы строите новое здание или делаете большую реконструкцию существующего здания, мы предложим проект вновь возводимой строительной части лифтов, чтобы гарантировать безопасность, функциональность и эстетическое сочетание с остальной архитектурой</strong></li>
            <li class="side__li"><strong>У нас есть команда опытных проектировщиков, которые готовы создать индивидуальный проект для ваших потребностей и предоставить вам качественную и профессиональную услугу.</strong></li>
        </ul>
    </div>`,
    },
    {
        id: "sd_1",
        top: `<div class="top__content">
        <h1 class="top__title">Поставка лифтов</h1>
        <p class="top__text">На протяжении более 16 лет компания "Лифт Комплекс" благополучно сотрудничает с производителями лифтов из разных стран</p>
        <p class="top__text" id="toptextS">Благодаря надежным партнерам, у нас есть возможность безупречно и в срок осуществлять доставку лифтов, эскалаторов и подъемников в Россию даже при наличии ограничений.</p>
        <p class="top__text" id="toptextS1">Так что не медлите, доверьтесь нам, и мы с удовольствием поможем Вам воплотить в жизнь Ваш проект!
        </p>
    </div>
    <img src="img/services/delyvery1440.jpg" alt="photo">`,
        side: `<div class="side__top" id="sideS">
        <h1 class="side__title">СРОКИ ПОСТАВКИ</h1>
        <ul class="side__ul">
            <li class="sideS__li"><strong>Мы сотрудничаем с надежными поставщиками, что позволяет нам доставлять лифтовое оборудование вовремя и без сбоев.</strong></li>
            <li class="side__li"><strong>Время доставки может варьироваться в зависимости от производителя и типа оборудования:</strong></li>
            <li class="side__li"><strong>- Если мы заказываем из Европы, срок поставки составляет примерно 8-12 недель.</strong></li>
            <li class="side__li"><strong>- Если оборудование поступает из Азии, время доставки увеличивается до 16-18 недель.</strong></li>
            <li class="side__li"><strong>- Отечественные заводы обычно доставляют наше оборудование за 2,5 месяца.</strong></li>
            <li class="side__li"><strong>Мы всегда стараемся сократить сроки и обеспечить бесперебойную поставку для наших клиентов.</strong></li>
        </ul>
        <h1 class="side__title">ПОСТАВЛЯЕМАЯ ПРОДУКЦИЯ</h1>
        <ul class="side__ul">
            <li class="side__li"><strong>Мы поставляем широкий ассортимент подъемного оборудования по Москве и Подмосковью от ведущих производителей: Kone, Thyssenkrupp, OTIS, Prolift, Orona, ELM, КМЗ, ЩЛЗ, МЛМ и др и готовы поставить для вас:</strong></li>
            <li class="side__li"><strong>- Пассажирские лифты</strong></li>
            <li class="side__li"><strong>- Больничные лифты</strong></li>
            <li class="side__li"><strong>- Панорамные лифты;</strong></li>
            <li class="side__li"><strong>- Высокоскоростные лифты</strong></li>
            <li class="side__li"><strong>- Эскалаторы и траволаторы</strong></li>
            <li class="side__li"><strong>- Грузовые лифты</strong></li>
            <li class="side__li"><strong>- Малогрузовые лифты</strong></li>
            <li class="side__li"><strong>- Автомобильные лифты</strong></li>
        </ul>
        <h1 class="side__title">НАШИ ГАРАНТИИ</h1>
        <ul class="side__ul">
            <li class="side__li"><strong>- У нас огромный опыт в области поставок оборудования, и безопасное сопровождение груза - наша неотъемлемая составляющая.</strong></li>
            <li class="side__li"><strong>- Когда дело касается стоимости поставки оборудования, мы всегда предоставляем точную информацию, указывая конечную цену в контракте.</strong></li>
            <li class="side__li"><strong>Нам важно, чтобы вы были уверены - цена не изменится.</strong></li>
            <li class="side__li"><strong>- А что касается сроков поставки, мы гарантируем их соблюдение. Техника будет доставлена в точно оговоренное время. Время доставки зависит от типа оборудования, но мы всегда стремимся выполнить поставку в минимально возможные сроки.</strong></li>
        </ul>
        <h1 class="side__title">ЕЩЕ О ПРЕИМУЩЕСТВАХ НАШЕЙ КОМПАНИИ</h1>
        <ul class="side__ul">
            <li class="side__li"><strong>Наши услуги не ограничиваются поставкой лифтов. Мы предлагаем полный комплекс услуг, включающий проектирование, техническое обслуживание и монтаж лифтов, а также:</strong></li>
            <li class="side__li"><strong>- Диспетчеризация</strong></li>
            <li class="side__li"><strong>- Модернизация лифтового оборудования.</strong></li>
            <li class="side__li"><strong>- Ремонт.</strong></li>
            <li class="side__li"><strong>Мы стремимся удовлетворить все ваши запросы и предоставить вам полное и качественное решение в сфере лифтового оборудования.</strong></li>
            <li class="side__li"><strong>Мы можем выполнить эксклюзивную отделку вашего лифта, используя самые крутые материалы, инновационные технологии и дизайнерские решения.</strong></li>
            <li class="side__li"><strong>Вместе мы сможем создать приватный лифт, который будет подчеркивать ваш статус и превращать пользование подъемным оборудованием в настоящее удовольствие.</strong></li>
            <li class="side__li"><strong>Ведь разве не прекрасно иметь уникальный и неповторимый лифт, который будет отражать ваш индивидуальный стиль и эстетические предпочтения?</strong></li>
            <li class="side__li"><strong>Мы готовы взять на себя все работы, начиная от дизайн-концепции и заканчивая контролем качества на всех этапах.</strong></li>
            <li class="side__li"><strong>Согласования со всеми необходимыми инстанциями и подготовка технической документации - все будет выполнено в установленные сроки.</strong></li>
            <li class="side__li"><strong>Мы стремимся к безупречному результату, чтобы вы могли наслаждаться вашим индивидуальным лифтом по полной программе!</strong></li>
            <li class="side__li"><strong>Так что не стесняйтесь обратиться к нам, и мы с радостью поможем воплотить ваши самые смелые идеи в реальность!</strong></li>
        </ul>
    </div>`,
    },
    {
        id: "sd_2",
        top: `<div class="top__content">
        <h1 class="top__title">Монтаж лифтов</h1>
        <p class="top__text">Компания "Лифт Комплекс" с 2007 года успешно занимается монтажом лифтов в Москве и Подмосковье
        У нас за плечами более 16 лет опыта, в которые мы установили и довели до совершенства более 1467 единиц грузоподъемного оборудования.</p>
        <p class="top__text" id="toptextS">Мы гордимся тем, что смогли реализовать проекты на более чем 150 объектах, включая стратегически важные и объекты с повышенной секретностью. Ваша безопасность и надежность нашего оборудования - наши главные приоритеты.</p>
        <p class="top__text" id="toptextS1"> Мы внимательно подходим к каждому проекту, осуществляем комплексное проектирование и соблюдаем всех необходимых стандартов безопасности.Кроме того, мы гарантируем качество наших работ и полное соответствие требованиям и ожиданиям клиентов. 
        </p>
    </div>
    <img src="img/services/montaj1440.jpg" alt="photo">`,
        side: `<div class="side__top" id="sideS">
        <h1 class="side__title">Гарантии услуги по монтажу лифта:</h1>
        <ul class="side__ul">
            <li class="side__li"><strong>- Выполнение работ в полном соответствии с заключенным договором, проектом и/или техническим заданием.</strong></li>
            <li class="side__li"><strong>- Предоставление полной и правильной информации о ходе всех этапов монтажа.</strong></li>
            <li class="side__li"><strong>- Быстрое решение любых возникающих вопросов и доступность для связи в режиме 24/7.</strong></li>
            <li class="side__li"><strong>- Мы предложим вам лучшие сроки и цены на рынке для установки лифтов.</strong></li>
        </ul>
        <h1 class="side__title">ПОЧЕМУ СТОИТ ВЫБРАТЬ ИМЕЕНО НАС?</h1>
        <ul class="side__ul">
            <li class="side__li"><strong>- Монтаж под ключ: Мы занимаемся всеми этапами процесса установки лифтов - от разработки проекта до пуско-наладки. Вам не нужно обращаться к разным специалистам, мы возьмем на себя все работы.</strong></li>
            <li class="side__li"><strong>- Индивидуальный подход: Мы гарантируем, что каждый клиент останется довольным. Мы внимательно выслушаем ваши пожелания и требования, чтобы обеспечить максимальную удовлетворенность результатом. При этом наши цены на монтаж лифтов ниже рыночных.</strong></li>
            <li class="side__li"><strong>- Соблюдение сроков: Мы придерживаемся реальных сроков выполнения работ и всегда выполняем свои обязательства перед клиентами. Вы можете быть уверены, что проект будет завершен вовремя.</strong></li>
            <li class="side__li"><strong>- Качество нашей работы - наш главный приоритет. Все наши сотрудники обладают высокой квалификацией и постоянно повышают свои навыки. Мы также строго контролируем качество всех этапов монтажа лифта.</strong></li>
            <li class="side__li"><strong>- Прозрачные условия договора: В договоре четко прописываются все обязательства и условия. Мы не боимся включать штрафные санкции за просрочки, потому что всегда выполняем работу в срок.</strong></li>
        </ul>
    </div>`,
    },
    {
        id: "sd_3",
        top: `<div class="top__content">
        <h1 class="top__title">Замена лифтов</h1>
        <p class="top__text">Как известно, что каждая единица грузоподъемного оборудования имеет свой предельный срок службы, определенный в соответствии с требованиями технического регламента ТР ТС 011/2011.</p>
        <p class="top__text" id="toptextS">Если лифты были введены в эксплуатацию до вступления в силу регламента ТР ТС 011/2011 и уже проработали свой намеченный срок службы в 25 лет (согласно статье 4 пункт 5), то их необходимо привести в соответствие с требованиями регламента в течение 7 лет с момента его вступления в силу. В таком случае требуется заменить все лифты, которые отработали свой назначенный срок службы(25 лет).</p>
        <p class="top__text" id="toptextS1"> Мы производим замену лифта в действующих зданиях, сохраняя при этом безупречную работоспособность объекта. Замену производим быстро и удобно для каждого клиента! 
        </p>
    </div>
    <img src="img/services/replacement1440.jpg" alt="photo">`,
        side: `<div class="side__top" id="sideS">
        <h1 class="side__title">ОСОБЕННОСТИ ЗАМЕНЫ ЛИФТОВ</h1>
        <ul class="side__ul">
            <li class="side__li"><strong>Замена лифтов для владельцев многоэтажных зданий - сложный и дорогостоящий процесс, и в этом нет сомнений.</strong></li>
            <li class="side__li"><strong>Чтобы заменить старое оборудование на новое, необходимо провести экспертное обследование лифта, чтобы определить его состояние и функциональность.</strong></li>
            <li class="side__li"><strong>По результатам этого обследования комиссия делает заключение о непригодности устаревшего лифта для эксплуатации и невозможности проведения капитального ремонта.</strong></li>
            <li class="side__li"><strong>Только после этого мы, компания "Корона лифт", можем приступить к замене лифта с соблюдением нормативных требований и правил безопасности.</strong></li>
            <li class="side__li"><strong>Мы готовы предложить вам высококачественные услуги по замене лифтов, чтобы сделать ваше здание более современным и безопасным.</strong></li>
        </ul>
        <h1 class="side__title">ПОДБОР ЛИФТОВ ДЛЯ ИХ ЗАМЕНЫ</h1>
        <ul class="side__ul">
            <li class="side__li"><strong>В компании "лифт Комплекс" мы стремимся не только предложить своим клиентам качественное и безопасное лифтовое оборудование, но и обеспечить им оптимальное соотношение цены и качества. Мы внимательно изучаем потребности каждого заказчика и предлагаем самые подходящие варианты подъемно-транспортных устройств, которые отличаются долговечностью и энергоэффективностью. Наш широкий ассортимент позволяет найти решение для любого бюджета. Если у вас возникли вопросы о замене лифтов в Москве или других городах России, не стесняйтесь обращаться по телефону +7 495 662-98-17. Мы будем рады помочь вам с выбором и установкой нового лифта!</strong></li>
        </ul>
    </div>`,
    },
    {
        id: "sd_4",
        top: `<div class="top__content">
        <h1 class="top__title">Техническое обслуживание лифтов</h1>
        <p class="top__text">Ни одно грузоподъемное устройство не обходится без своевременного технического обслуживания. Это важно для гарантированной безопасности и надежности работы подъемного оборудования.</p>
        <p class="top__text" id="toptextS">Уже более 16 лет компания "Лифт Комплекс" занимается обслуживанием различного подъемного оборудования на объектах по всей Москве. Мы гордимся тем, что на данный момент мы обслуживаем более - 2450 единиц. Это свидетельствует о доверии, которое нам оказывают наши клиенты, и о нашей надежности в работе. 
        </p>
    </div>
    <img src="img/services/servise1440.jpg" alt="photo">`,
        side: `<div class="side__top" id="sideS">
        <h1 class="side__title">ОБСЛУЖИВАНИЕ ЛИФТОВОГО ОБОРУДОВАНИЯ У НАС ЭТО ВЫГОДНО!</h1>
        <ul class="side__ul">
            <li class="side__li"><strong>- Более 16 лет мы успешной работы с любыми типами оборудования подъемного оборудования.</strong></li>
            <li class="side__li"><strong>- У нас имеется три круглосуточные аварийные службы в Москве, готовые помочь в любой ситуации.</strong></li>
            <li class="side__li"><strong>- Собственный полноценный отдел снабжения, что позволяет нам обеспечивать клиентов всем необходимым.</strong></li>
            <li class="side__li"><strong>- Мы гордимся нашей лояльной и комфортной для заказчика системой ценообразования.</strong></li>
            <li class="side__li"><strong>- Кроме того, у нас реализована трехступенчатая система контроля качества оказываемых услуг, чтобы гарантировать надежность и профессионализм.</strong></li>
            <li class="side__li"><strong>- И, конечно же, мы можем предоставить техническое обслуживание с постоянным присутствием нашего персонала на вашем объекте.</strong></li>
        </ul>
        <h1 class="side__title">МЫ ПРЕДЛАГАЕМ ШИРОКИЙ СПЕКТ УСЛУГ ПО АВАРИЙНО-ТЕХНИЧЕСКОМУ ОБСЛУЖИВАНИЮ И РЕМОНТУ ЛИФТОВ</h1>
        <ul class="side__ul">
            <li class="side__li"><strong> - Осмотр оборудования и составление акта дефектации.</strong></li>
            <li class="side__li"><strong> - Замена расходных материалов и наиболее изношенных блоков.</strong></li>
            <li class="side__li"><strong> - Ежемесячные технические работы, выполненные в соответствии с требованиями Таможенного союза "ТР ТС 011/2011" и ГОСТ 53780-2010, чтобы обеспечить безопасность и эффективность работы лифтов.</strong></li>
            <li class="side__li"><strong> - Наша аварийная служба доступна круглосуточно и готова прибыть в течение 30 минут с момента вызова, чтобы оперативно устранить любые неполадки.</strong></li>
            <li class="side__li"><strong> - В случае необходимости мы также предлагаем экстренный ремонт, чтобы минимизировать простои оборудования и обеспечить непрерывность его работы.</strong></li>
            <li class="side__li"><strong> - Подготовка оборудования и проведение ежегодного технического освидетельствования, чтобы гарантировать соответствие вашего лифтового оборудования стандартам безопасности и надежности.</strong></li>
        </ul>
    </div>`,
    },
    {
        id: "sd_5",
        top: `<div class="top__content">
        <h1 class="top__title">Модернизация лифтов</h1>
        <p class="top__text">Обычно, после 15-20 лет эксплуатации, лифтовое оборудование становится значительно изношенным.
        Тогда возникает вопрос: стоит ли заменить лифт полностью или провести его модернизацию?</p>
        <p class="top__text" id="toptextS">Главная причина, по которой многие выбирают модернизацию, заключается в том, что некоторые компоненты, которые не подвергаются постоянной нагрузке, могут продолжать работать еще несколько десятилетий. Еще одной важной пользой модернизации является экономия денежных средств. 
        </p>
    </div>
    <img src="img/services/modernization1440.jpg" alt="photo">`,
        side: `<div class="side__top" id="sideS">
        <h1 class="side__title">ПРИЗНАКИ ТОГО, ЧТО ЛИФТУ НЕОБХОДИМА МОДЕРНИЗАЦИЯ:</h1>
        <ul class="side__ul">
            <li class="side__li"><strong>- Срок эксплуатации превышает 10 лет</strong></li>
            <li class="side__li"><strong>- Оборудование не соответствует современным стандартам безопасности</strong></li>
            <li class="side__li"><strong>- Изменение назначения здания</strong></li>
            <li class="side__li"><strong>- Уровень шума выше допустимого.</strong></li>
            <li class="side__li"><strong>- Поврежденная или изношенная внутренняя отделка кабины</strong></li>
            <li class="side__li"><strong>- Ограничения в работе кнопок панели управления</strong></li>
            <li class="side__li"><strong>- Нестабильная связь с диспетчером</strong></li>
            <li class="side__li"><strong>- Частые ремонтные работы</strong></li>
            <li class="side__li"><strong>- Увеличенное время ожидания</strong></li>
            <li class="side__li"><strong>- Неплавное движение кабины</strong></li>
            <li class="side__li"><strong>- Кабина не выравнена по отношению к полу</strong></li>
            <li class="side__li"><strong>- Изменение интервала перед автоматическим закрытием дверей.</strong></li>
            <li class="side__li"><strong>Если вы заметили хотя бы один из этих признаков, то, вероятно, пришло время задуматься о модернизации лифтового оборудования.</strong></li>
        </ul>
        <h1 class="side__title">ВИДЫ МОДЕРНИЗАЦИИ ЛИФТОВОГО ОБОРУДОВАНИЯ</h1>
        <ul class="side__ul">
            <li class="side__li"><strong>Полная модернизация:</strong></li>
            <li class="side__li"><strong>- При этом типе модернизации лифтового оборудования обычно меняются все его составные части, кроме направляющих лифтовой кабины и противовеса.</strong></li>
            <li class="side__li"><strong>Комплексная модернизация:</strong></li>
            <li class="side__li"><strong>- Этот тип модернизации лифтового оборудования включает в себя части полной модернизации, кроме замены рам и других металлоконструкций, при условии что Уполномоченный Инженерный Центр подтвердит их пригодное состояние и хороший запас прочности.</strong></li>
            <li class="side__li"><strong>Частичная модернизация:</strong></li>
            <li class="side__li"><strong>- Представляет собой замену отдельных узлов по желанию заказчика, но должна осуществляться на основе рекомендаций квалифицированного специалиста по результатам анализа оборудования, так как безопасность пассажиров превыше всего!</strong></li>
        </ul>
    </div>`,
    },
];

let idSd = localStorage.getItem("LiftComplexServ");
//localStorage.removeItem("LiftComplexServ");

const topS_El = document.querySelector("#topS");
const sideS_El = document.querySelector("#sideS");

topS_El.innerHTML += servicesDetails[idSd].top;
sideS_El.innerHTML += servicesDetails[idSd].side;
